# OpeningType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisOpening..::..OpeningType Property
EnergyAnalysisOpening Class See Also
---
The analytical opening type.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public EnergyAnalysisOpeningType OpeningType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property OpeningType As EnergyAnalysisOpeningType
	Get
```

Visual C++
---
```text
public:
property EnergyAnalysisOpeningType OpeningType {
	EnergyAnalysisOpeningType get ();
}
```

# See Also
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace